{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen/Qwen2-1.5B",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "layers.1.self_attn.k_proj",
    "layers.3.self_attn.v_proj",
    "layers.15.self_attn.v_proj",
    "layers.24.self_attn.v_proj",
    "layers.8.self_attn.v_proj",
    "layers.8.self_attn.k_proj",
    "layers.15.self_attn.k_proj",
    "layers.19.self_attn.v_proj",
    "layers.12.self_attn.k_proj",
    "layers.6.self_attn.k_proj",
    "layers.23.self_attn.k_proj",
    "layers.13.self_attn.k_proj",
    "layers.1.self_attn.v_proj",
    "layers.2.self_attn.v_proj",
    "layers.10.self_attn.v_proj",
    "layers.17.self_attn.v_proj",
    "layers.14.self_attn.k_proj",
    "layers.0.self_attn.k_proj",
    "layers.6.self_attn.v_proj",
    "layers.26.self_attn.k_proj",
    "layers.16.self_attn.k_proj",
    "layers.14.self_attn.v_proj",
    "layers.24.self_attn.k_proj",
    "layers.20.self_attn.k_proj",
    "layers.5.self_attn.v_proj",
    "layers.10.self_attn.k_proj",
    "layers.22.self_attn.v_proj",
    "layers.2.self_attn.k_proj",
    "layers.13.self_attn.v_proj",
    "layers.7.self_attn.v_proj",
    "layers.22.self_attn.k_proj",
    "layers.3.self_attn.k_proj",
    "layers.21.self_attn.k_proj",
    "layers.16.self_attn.v_proj",
    "layers.7.self_attn.k_proj",
    "layers.27.self_attn.v_proj",
    "layers.12.self_attn.v_proj",
    "layers.18.self_attn.v_proj",
    "layers.23.self_attn.v_proj",
    "layers.18.self_attn.k_proj",
    "layers.4.self_attn.v_proj",
    "layers.4.self_attn.k_proj",
    "layers.17.self_attn.k_proj",
    "layers.19.self_attn.k_proj",
    "layers.25.self_attn.k_proj",
    "layers.27.self_attn.k_proj",
    "layers.20.self_attn.v_proj",
    "layers.9.self_attn.v_proj",
    "layers.11.self_attn.v_proj",
    "layers.11.self_attn.k_proj",
    "layers.26.self_attn.v_proj",
    "layers.9.self_attn.k_proj",
    "layers.25.self_attn.v_proj",
    "layers.0.self_attn.v_proj",
    "layers.5.self_attn.k_proj",
    "layers.21.self_attn.v_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}